<rss version="2.0" xmlns:atom="http://www.w3.org/2005/Atom">
  <channel>
    <title>co3site&#39;s Blog on co3site&#39;s Blog</title>
    <link>https://co3site.github.io/</link>
    <description>Recent content in co3site&#39;s Blog on co3site&#39;s Blog</description>
    <generator>Hugo -- gohugo.io</generator>
    <language>zh-cn</language>
    <lastBuildDate>Mon, 01 Jul 2019 10:15:30 +0800</lastBuildDate>
    <atom:link href="/" rel="self" type="application/rss+xml" />
    
    <item>
      <title>进程学习记要</title>
      <link>https://co3site.github.io/2019/process/</link>
      <pubDate>Mon, 01 Jul 2019 10:15:30 +0800</pubDate>
      
      <guid>https://co3site.github.io/2019/process/</guid>
      <description>

&lt;h2 id=&#34;0x00-进程简介&#34;&gt;0x00 进程简介&lt;/h2&gt;

&lt;p&gt;&lt;strong&gt;进程（Process）&lt;/strong&gt;：计算机中的程序关于某数据集合上的一次运行活动，是系统进行资源分配和调度的基本单位，是操作系统结构的基础。通俗来讲，进程就是一个虚拟4GB的容器空间（对于Win32环境来讲），所谓虚拟是指并不是真正地占据4GB大小的内存，而是通过映射（Map）的方式使虚拟内存达到4GB。某一.exe可执行文件双击运行时，首先将程序文件拉伸到4GB空间中，对齐方式由FileAlignment拉伸为SectionAlignment（具体可参看PE结构NT头部中的OptionalHeader）。一般来说（WindowsNT 3环可达到3GB），分配的4GB空间中的低2GB（0x00000000 - 0x7FFFFFFF）用于3环使用，具体到前64KB（0x00000000 - 0x0000FFFF）用于存储NULL指针，后面的空间（0x00010000 - 0x7FFFFFFF）用来存储运行程序时所要用到的所有PE文件（包括程序用到的所有的动态链接库等）拉伸后的状态；高2GB（0x80000000 - 0xFFFFFFFF）为0环内核层所使用的空间。&lt;/p&gt;

&lt;h2 id=&#34;0x01-进程跑起跟踪&#34;&gt;0x01 进程跑起跟踪&lt;/h2&gt;

&lt;p&gt;一个进程从你双击其.exe可执行文件起，操作系统到底都做了那些事情来让程序跑起来呢？&lt;br /&gt;
首先，将exe文件拉伸映射存储到低2G的指定的内存空间中（ImageBase）；

	PROCESS_INFORMATION pi;
	TCHAR cmdline[] = TEXT(&amp;quot; https://bing.com&amp;quot;);
	BOOL status = ::CreateProcess(TEXT(&amp;quot;C:\\Program Files\\Internet Explorer\\iexplore.exe&amp;quot;), cmdline, &amp;amp;sa_p, &amp;amp;sa_t,TRUE,
					   CREATE_NEW_CONSOLE,NULL,TEXT(&amp;quot;C://&amp;quot;),&amp;amp;si,&amp;amp;pi);
	
	return 0;
}
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;以上代码创建的进程的线程句柄和进程句柄便可以在其他的子进程来进行接收，进而可以进行相应的控制。这里梳理一下其中的进程关系，我们代码所在的程序运行后也是一个进程，是在该代码中创建的其他进程的父进程，以上代码中创建的调用IE浏览器打开必应的进程为子进程A，如若在代码中再创建一个进程便为子进程B，子进程A可被继承，在子进程B中便可以接收到子进程的进程和线程句柄来达到相应的控制。其他内核对象的继承也和此类似，给定相应的SECURITY_ATTRIBUTES来配置安全属性即可，具体的继承原理，感兴趣的同学可以查看句柄表相关的资料。&lt;/p&gt;

&lt;h2 id=&#34;0x04-结束进程&#34;&gt;0x04 结束进程&lt;/h2&gt;

&lt;p&gt;进程的结束主要可以通过以下3种形式：&lt;/p&gt;

&lt;ol&gt;
&lt;li&gt;进程自身调用ExitProcess(UINT ExitCode)来结束进程；&lt;/li&gt;
&lt;li&gt;在其他进程中通过调用TerminateProcess(HANDLE hProcess, UINT ExitCode)来结束相应句柄的进程；&lt;/li&gt;
&lt;li&gt;通过结束进程中的所有线程来结束进程；
&lt;br /&gt;&lt;/li&gt;
&lt;/ol&gt;

&lt;p&gt;一个进程结束后，进程中所有的线程也全部结束；进程使用的堆栈空间将被释放；进程高2G内核对象句柄表中的所有内核对象将全被关闭；该进程对象发出通知信号；操作系统中属于该进程的内核对象使用的计数-1，一段时间后如若不再使用，该内核对象将会被操作系统进行销毁。&lt;/p&gt;

&lt;h2 id=&#34;0x05-以挂起的形式创建进程&#34;&gt;0x05 以挂起的形式创建进程&lt;/h2&gt;

&lt;pre&gt;&lt;code class=&#34;language-C&#34;&gt;#include &amp;lt;iostream&amp;gt;
#include &amp;lt;windows.h&amp;gt;
using namespace std;

int main()
{
	STARTUPINFO si = {0};
	si.cb = sizeof(STARTUPINFO);

	PROCESS_INFORMATION pi;

	//TCHAR cmdline[256] = TEXT(&amp;quot;C:\\Program Files\\Internet Explorer\\iexplore.exe&amp;quot;);
	BOOL status = CreateProcess(TEXT(&amp;quot;C:\\PETool 1.0.0.5.exe&amp;quot;), NULL, NULL, NULL,NULL,CREATE_SUSPENDED,NULL,NULL,&amp;amp;si,&amp;amp;pi);

	if (status)
	{
		//获取创建进程的主线程context
		CONTEXT context = {0};
		context.ContextFlags = CONTEXT_ALL;
		GetThreadContext(pi.hThread, &amp;amp;context);

		//获取程序入口点（ImageBase + OEP）
		cout &amp;lt;&amp;lt; &amp;quot;Entry Point(OA):&amp;quot; &amp;lt;&amp;lt; hex &amp;lt;&amp;lt; context.Eax &amp;lt;&amp;lt; endl;

		//获取ImageBase	
		CHAR* baseAddress = (CHAR*)(context.Ebx + 8);
		DWORD buffer[2] = { 0 };
		ReadProcessMemory(pi.hProcess, baseAddress, buffer, 4, NULL);
		cout &amp;lt;&amp;lt; &amp;quot;ImageBase:&amp;quot; &amp;lt;&amp;lt; hex &amp;lt;&amp;lt; *buffer &amp;lt;&amp;lt; endl;

		//恢复进程运行（主线程）
		ResumeThread(pi.hThread);

		//关闭句柄，计数器-1
		CloseHandle(pi.hThread);
		CloseHandle(pi.hProcess);
	}
	return 0;
}
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;以上代码是以挂起形式创建的进程，dwCreationFlags为CREATE_SUSPENDED，改代码中创建的进程为PETool 1.0.0.5.exe（可替换为其他的EXE可执行程序）。一个进程以挂起的形式创建其本质是该进程创建时他的主线程处于挂起的状态，获取主线程的CONTEXT结构，我们便可以得到进程创建时挂起的相关信息，其中context.Eax为程序的入口点，为程序拉升填充到内存中的地址ImageBase+OEP；context.Ebx为程序的&lt;a href=&#34;https://docs.microsoft.com/zh-cn/windows/win32/api/winternl/ns-winternl-_peb&#34; rel=&#34;nofollow noreferrer&#34; target=&#34;_blank&#34;&gt;PEB结构&lt;/a&gt;（Process Envirorment Block Structure），关于PEB会在后面进行系统的学习和测试练习，其中在context.Ebx的第8字节处便存放着ImageBase的信息。&lt;/p&gt;

&lt;pre&gt;&lt;code class=&#34;language-C&#34;&gt;nt!_PEB  
   +0x000 InheritedAddressSpace : UChar
   +0x001 ReadImageFileExecOptions : UChar
   +0x002 BeingDebugged    : UChar
   +0x003 SpareBool        : UChar
   +0x004 Mutant           : Ptr32 Void
   -&amp;gt; 0x008 ImageBaseAddress : Ptr32 Void
   +0x00c Ldr              : Ptr32 _PEB_LDR_DATA
   +0x010 ProcessParameters : Ptr32 _RTL_USER_PROCESS_PARAMETERS
   +0x014 SubSystemData    : Ptr32 Void
   +0x018 ProcessHeap      : Ptr32 Void
   +0x01c FastPebLock      : Ptr32 _RTL_CRITICAL_SECTION
   +0x020 FastPebLockRoutine : Ptr32 Void
   +0x024 FastPebUnlockRoutine : Ptr32 Void
   +0x028 EnvironmentUpdateCount : Uint4B
   +0x02c KernelCallbackTable : Ptr32 Void
   +0x030 SystemReserved   : [1] Uint4B
   +0x034 AtlThunkSListPtr32 : Uint4B
   +0x038 FreeList         : Ptr32 _PEB_FREE_BLOCK
   +0x03c TlsExpansionCounter : Uint4B
   +0x040 TlsBitmap        : Ptr32 Void
   +0x044 TlsBitmapBits    : [2] Uint4B
   +0x04c ReadOnlySharedMemoryBase : Ptr32 Void
   +0x050 ReadOnlySharedMemoryHeap : Ptr32 Void
   +0x054 ReadOnlyStaticServerData : Ptr32 Ptr32 Void
   +0x058 AnsiCodePageData : Ptr32 Void
   +0x05c OemCodePageData  : Ptr32 Void
   +0x060 UnicodeCaseTableData : Ptr32 Void
   +0x064 NumberOfProcessors : Uint4B
   +0x068 NtGlobalFlag     : Uint4B
   +0x070 CriticalSectionTimeout : _LARGE_INTEGER
   +0x078 HeapSegmentReserve : Uint4B
   +0x07c HeapSegmentCommit : Uint4B
   +0x080 HeapDeCommitTotalFreeThreshold : Uint4B
   +0x084 HeapDeCommitFreeBlockThreshold : Uint4B
   +0x088 NumberOfHeaps    : Uint4B
   +0x08c MaximumNumberOfHeaps : Uint4B
   +0x090 ProcessHeaps     : Ptr32 Ptr32 Void
   +0x094 GdiSharedHandleTable : Ptr32 Void
   +0x098 ProcessStarterHelper : Ptr32 Void
   +0x09c GdiDCAttributeList : Uint4B
   +0x0a0 LoaderLock       : Ptr32 Void
   +0x0a4 OSMajorVersion   : Uint4B
   +0x0a8 OSMinorVersion   : Uint4B
   +0x0ac OSBuildNumber    : Uint2B
   +0x0ae OSCSDVersion     : Uint2B
   +0x0b0 OSPlatformId     : Uint4B
   +0x0b4 ImageSubsystem   : Uint4B
   +0x0b8 ImageSubsystemMajorVersion : Uint4B
   +0x0bc ImageSubsystemMinorVersion : Uint4B
   +0x0c0 ImageProcessAffinityMask : Uint4B
   +0x0c4 GdiHandleBuffer  : [34] Uint4B
   +0x14c PostProcessInitRoutine : Ptr32     void 
   +0x150 TlsExpansionBitmap : Ptr32 Void
   +0x154 TlsExpansionBitmapBits : [32] Uint4B
   +0x1d4 SessionId        : Uint4B
   +0x1d8 AppCompatFlags   : _ULARGE_INTEGER
   +0x1e0 AppCompatFlagsUser : _ULARGE_INTEGER
   +0x1e8 pShimData        : Ptr32 Void
   +0x1ec AppCompatInfo    : Ptr32 Void
   +0x1f0 CSDVersion       : _UNICODE_STRING
   +0x1f8 ActivationContextData : Ptr32 Void
   +0x1fc ProcessAssemblyStorageMap : Ptr32 Void
   +0x200 SystemDefaultActivationContextData : Ptr32 Void
   +0x204 SystemAssemblyStorageMap : Ptr32 Void
   +0x208 MinimumStackCommit : Uint4B
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;运行结果：&lt;/p&gt;

&lt;pre&gt;&lt;code class=&#34;language-md&#34;&gt;Entry Point(OA):4193be
ImageBase:400000
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;PETool查询自身PETool 1.0.0.5.exe的PE信息结果：&lt;/p&gt;

&lt;pre&gt;&lt;code class=&#34;language-md&#34;&gt;==========================================================================
文件路径：&amp;quot;C:\PETool 1.0.0.5.exe&amp;quot;

是否PE文件    ：是
文件大小      ：208896 字节
创建时间      ：2019.07.26 22:06:25
修改时间      ：2012.07.29 22:11:32
访问时间      ：2019.07.26 22:06:25
运行平台      ：Win32 位
PE文件头地址  ：0x00000100
基地址        ：0x00400000
入口点EP(RVA) ：0x000193BE
入口点OEP(RAW)：0x000193BE
入口点EP所在节：[.text] [1/4]
入口点EP首字节：55 8B EC 6A FF 68 20 F7 
区段数目      ：4 个
链接器版本信息：6.0
子系统        ：Windows 图形用户界面/图形接口子系统(Image runs in the Windows GUI subsystem.)
==========================================================================
&lt;/code&gt;&lt;/pre&gt;

&lt;p&gt;由上比较可见，程序运行的结果和我们用PE工具查询得到的结果一致。&lt;/p&gt;

